# Задание 2. Напишите функцию,
# которая будет выводить в консоль приветствие
# «Welcome»;
def Welcome():
    print("Welcome")
Welcome()