# Задание 3. Напишите функцию,
# которая будет принимать строку(чье-то имя) и
# выводить в консоль приветствие «Hello, <name>»;
def hello(name):
    print("Hello " + name)
hello("Nikolay")