# Задание 4. Напишите функцию для нахождения произведения чисел.
# Функция принимает 2 числа и возвращает результат умножения этих чисел;
def multiplication(a,b):
    return a*b
print(multiplication(8, 8))