# Задание 5. Напишите функцию для перевода метров в километры.
# Функция принимает число(расстояние в метрах) и возвращает расстояние в километрах;
def meter_to_kilometers(meter):
    return meter * 0.001
print(meter_to_kilometers(50))