# Задание 8. Напишите функцию, которая находит диаметр по радиусу. Функция должна вернуть число;
def find_diameter(rad):
    return 2 * rad
print(find_diameter(5))