# Задание 4. Напишите функцию, для нахождения наибольшего из двух чисел. Функция
# принимает два числа и возвращает наибольшее из них;
def biggest_num(a,b):
    return a if a > b else b
print(biggest_num(8,10))