# Задание 9. Определите, содержит ли массив данное число x
x = int(input('Введите число: '))
arr = [1, 2, 3, 4, 5]
if x in arr:
        print('Да')
else:
        print('Нет')